taskt/Core/Automation/Commands/JSONGroup/AddJSONArrayItemCommand.puml
@startuml
AddJSONArrayItemCommand --> AJSONAddInsertSetJContainerCommands
AJSONAddInsertSetJContainerCommands --> AJSONJSONPathCommands
AJSONAddInsertSetJContainerCommands --> IJSONValueActionProperties
AJSONJSONPathCommands --> AJSONInputJSONCommands
AJSONJSONPathCommands --> IJSONJSONPathProperties
AJSONInputJSONCommands --> ScriptCommand
AJSONInputJSONCommands --> IJSONInputJSONProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
